# Size Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
WireSize..::..Size Property
WireSize Class See Also
---
Get size symbol of wire.
**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public string Size { get; }
```

Visual Basic
---
```text
Public ReadOnly Property Size As String
	Get
```

Visual C++
---
```text
public:
property String^ Size {
	String^ get ();
}
```

# See Also
WireSize Class
Autodesk.Revit.DB.Electrical Namespace